import React from 'react'
import '../../App.css'
function TermForUse() {
    return (
        <div style={{ backgroundColor: `#336dff60`}}>
            <div className="container">
                <div className='header_about d-flex justify-content-center align-items-center '>
                    <a href="/">Home</a>
                </div>
                <div className="AboutKnowShareNote">
                    <div className="fs-2 text-center">
                        เงื่อนไขการให้บริการ KnowShare Note
                    </div>
                    <div className="fs-5">
                        - วัตถุประสงค์ <br />
                        ในการเข้าใช้งานและบริการเว็บไซต์ของท่านจะอยู่ภายใต้เงื่อนไข และข้อกำหนดดังต่อไปนี้ ดังนั้นท่านจึงควรศึกษาเงื่อนไข และข้อกำหนดในการใช้งานเว็บไซต์ โดยละเอียดก่อนการเข้าใช้บริการ
                        ทั้งนี้ในการใช้บริการ ให้ถือว่าท่านได้ตกลงที่จะปฏิบัติตามเงื่อนไข และข้อกำหนดการให้บริการที่กำหนดไว้ หากท่านไม่ประสงค์ที่จะเข้าใช้งานตามข้อกำหนดหรือเกิดความไม่สบายใจ จากเงื่อนไขการให้บริการ กรุณายุติการเข้าชม และใช้งานเว็บไซต์นี้ในทันที
                    </div>
                    <div className="fs-5">
                        - การใช้งานเว็บไซต์: การเข้าใช้งานเว็บไซต์นี้แสดงว่าผู้ใช้งานยอมรับและเห็นชอบเงื่อนไขการใช้งานทั้งหมดที่กำหนดไว้ <br />
                        - การอัพโหลดไฟล์: ผู้ใช้งานจะต้องไม่อัพโหลดไฟล์ที่มีเนื้อหาที่ไม่เหมาะสมหรือผิดกฎหมาย เช่น ไฟล์ละเมิดลิขสิทธิ์ ไฟล์ล่วงละเมิดความเป็นส่วนตัว หรือไฟล์ที่มีเนื้อหาเสียหายต่อผู้อื่น <br />
                        - การเข้าถึงไฟล์: ผู้ใช้งานสามารถเข้าถึงไฟล์ที่อยู่บนเว็บไชต์ได้ทั้งหมด แต่ไม่สามารถนำไฟล์ที่มีอยู่บนเว็บไซต์ไปต่อยอดหรือแชร์ให้กับบุคคลอื่นได้โดยไม่ได้รับอนุญาตจากเจ้าของไฟล์ <br />
                        - การติดต่อ: <br />
                        หากผู้ใช้งานมีข้อสงสัยหรือปัญหาใดๆเกี่ยวกับการใช้งานเว็บไซต์ สามารถติดต่อเราได้ทางอีเมล์หรือแบบฟอร์มติดต่อที่กำหนดไว้ในหน้าติดต่อเราของเว็บไซต์
                        เราจะพยายามตอบกลับคำถามหรือแก้ไขปัญหาให้ผู้ใช้งานได้อย่างรวดเร็ว แต่อาจใช้เวลาตามความซับซ้อนของปัญหา
                        ผู้ใช้งานสามารถติดตามข่าวสารและอัพเดตเว็บไซต์ได้ผ่านช่องทางต่างๆ เช่น อีเมล์แจ้งเตือน หรือทางสื่อสังคมออนไลน์ที่เราได้ลงทะเบียนไว้
                        เราขอสงวนสิทธิ์ในการปฏิเสธการตอบกลับคำถามหรือแก้ไขปัญหาใดๆที่ไม่เหมาะสมหรือซับซ้อนเกินไป และขอสงวนสิทธิ์ในการระงับการใช้งานเว็บไซต์ของผู้ใช้งานที่ฝ่าฝืนเงื่อนไขการใช้งานหรือกระทำผิดกฎหมาย
                        เรายินดีรับข้อเสนอแนะเพื่อปรับปรุงการให้บริการของเราให้ดียิ่งขึ้น โดยเราจะพยายามปรับปรุงเว็บไซต์อยู่เสมอเพื่อให้ผู้ใช้งานได้รับประสบการณ์การใช้งานที่ดีที่สุด
                    </div>
                    <div className="fs-5">
                        - เงื่อนไขและข้อกำหนดการใช้งานเว็บไซต์ <br />
                        การใช้งานเว็บไซต์ต้องเป็นไปตามกฎหมายและไม่ละเมิดสิทธิ์ของผู้อื่น โดยเฉพาะอย่างยิ่งสิทธิ์ทรัพย์สินทางปัญญา เช่น ไม่นำเผยข้อมูลลับของผู้ใช้งานอื่นๆ หรือละเมิดลิขสิทธิ์ของผลงานทางวิชาการ
                        ผู้ใช้งานจะต้องรักษาความปลอดภัยของเว็บไซต์ ไม่นำข้อมูลที่ไม่เหมาะสมหรืออันตรายเข้าสู่เว็บไซต์ หรือใช้เว็บไซต์เพื่อทำการแฮ็กและกระทำการที่ไม่เหมาะสม
                        ผู้ใช้งานจะต้องรับผิดชอบต่อข้อมูลที่ปรากฏบนเว็บไซต์ และจะไม่นำข้อมูลที่ปรากฏบนเว็บไซต์ไปใช้เพื่อกระทำการใดๆ ที่ผิดกฎหมายหรือไม่เหมาะสม
                        เว็บไซต์มีสิทธิ์ในการตัดสินใจเพิ่มหรือลดข้อมูลที่ปรากฏบนเว็บไซต์ เช่นการลบข้อมูลหรือผู้ใช้งานที่ไม่เหมาะสม
                        เว็บไซต์สามารถเปลี่ยนแปลงเงื่อนไขการใช้งานได้โดยไม่ต้องแจ้งให้ผู้ใช้งานทราบล่วงหน้า ดังนั้น ผู้ใช้งานควรตรวจสอบเงื่อนไขการใช้งานเว็บไซต์อย่างสม่ำเสมอ
                        เว็บไซต์อาจมีการเชื่อมโยงไปยังเว็บไซต์อื่นๆ แต่เว็บไซต์ไม่รับผิดชอบต่อเนื้อหาและความถูกต้องของเว็บไซต์อื่นๆ
                        เว็บไซต์ไม่รับประกันว่าเว็บไซต์จะเป็นไปตามความต้องการหรือไม่มีข้อผิดพลาดหรือข้อบกพร่องใดๆ ผู้ใช้งานจะต้องเข้าใจและรับผิดชอบต่อความเสี่ยงที่อาจเกิดขึ้น
                        ผู้ใช้งานจะต้องไม่นำเนื้อหาหรือข้อมูลใดๆ ที่ปรากฏบนเว็บไซต์ไปใช้เพื่อเป็นการค้าหรือการแสวงหาผลประโยชน์ในทางอื่นๆ
                        เว็บไซต์อาจเก็บข้อมูลส่วนบุคคลของผู้ใช้งาน เพื่อประโยชน์ในการวิเคราะห์และพัฒนาเว็บไซต์เท่านั้น ผู้ใช้งานควรอ่านนโยบายความเป็นส่วนตัวและข้อกำหนดในการเก็บข้อมูลส่วนบุคคลของเว็บไซต์อย่างรอบคอบ
                        เว็บไซต์อาจมีการใช้คุกกี้เพื่อจัดการข้อมูลการใช้งานของผู้ใช้งาน ผู้ใช้งานควรอ่านและยอมรับการใช้คุกกี้ก่อนที่จะเข้าใช้งานเว็บไซต์
                        เว็บไซต์อาจมีการเปลี่ยนแปลงเนื้อหาและบริการต่างๆ โดยไม่ต้องแจ้งให้ผู้ใช้งานทราบล่วงหน้า ผู้ใช้งานควรตรวจสอบเว็บไซต์เพื่อติดตามข่าวสารและการเปลี่ยนแปลงที่เกิดขึ้น
                        เว็บไซต์ไม่รับประกันความเสถียรของเครื่องมือหรืออุปกรณ์ที่ใช้ในการเข้าใช้งาน ผู้ใช้งานควรเช็คและตรวจสอบเครื่องมือหรืออุปกรณ์ที่ใช้ในการเข้าใช้งานก่อนใช้งานเว็บไซต์
                    </div>
                    <div className="fs-5">
                        - การปฏิเสธความรับผิด <br />
                        เราไม่รับผิดชอบต่อความเสียหายใด ๆ ที่เกิดขึ้นจากการใช้งานเว็บไซต์นี้ รวมถึงความเสียหายที่เกิดจากสินค้าหรือบริการที่ซื้อจากผู้ขายที่เชื่อมโยงกับเว็บไซต์นี้ หรือความเสียหายที่เกิดจากการดาวน์โหลดไฟล์จากเว็บไซต์นี้ ไม่ว่าจะเป็นความเสียหายทางตรงหรือทางอ้อม ไม่ว่าจะเป็นการสูญเสียข้อมูล การเสียหายในการใช้งาน ค่าใช้จ่าย หรือความเสียหายอื่น ๆ ที่อาจเกิดขึ้นได้
                        ทั้งนี้ หากเว็บไซต์นี้มีการเชื่อมโยงไปยังเว็บไซต์อื่น ๆ ที่เป็นเว็บไซต์ของบุคคลภายนอก เราไม่รับผิดชอบต่อความเสียหายใด ๆ ที่เกิดขึ้นจากการใช้งานเว็บไซต์เหล่านั้น
                    </div>
                    <div className="fs-5">
                        นอกเหนือจากนี้ เราไม่สามารถรับผิดชอบต่อความเสียหายใด ๆ ไม่ว่าจะเป็นค่าใช้จ่าย การสูญเสีย หรือการทำลายทั้งหมดที่เกิดขึ้นจากการใช้งานเว็บไซต์นี้หรือเว็บไซต์ที่เชื่อมโยงไปยังเว็บไซต์นี้ ไม่ว่าจะเป็นผลตรงหรือผลอ้อม รวมถึงการพลาด หยุดชะงัก ข้อบกพร่องของระบบคอมพิวเตอร์ ไวรัส หรือแม้กระทั่งเมื่อเราได้รับแจ้งว่าความเสียหายสูญเสีย หรือค่าใช้จ่ายดังกล่าวอาจจะเกิดขึ้นได้
                    </div>
                    <div className="fs-5">

                        - การใช้งานคุกกี้ (Cookies) <br />

                        การใช้งานคุกกี้: เว็บไซต์อาจมีการใช้งานคุกกี้เพื่อเก็บข้อมูลเกี่ยวกับการใช้งานของผู้ใช้งาน และเพื่อพัฒนาประสิทธิภาพในการให้บริการ
                        การเปิดเผยข้อมูล: เราจะไม่เปิดเผยข้อมูลที่เก็บรวบรวมได้จากคุกกี้ของผู้ใช้งานให้กับบุคคลภายนอกโดยไม่ได้รับอนุญาตก่อน แต่เราอาจใช้ข้อมูลดังกล่าวเพื่อวิเคราะห์การใช้งานและปรับปรุงคุณภาพของบริการในอนาคต
                        การปฏิบัติตามกฎหมาย: เราจะปฏิบัติตามกฎหมายของประเทศในการเก็บรวบรวมและใช้งานข้อมูลจากคุกกี้
                        การควบคุมคุกกี้: ผู้ใช้งานสามารถควบคุมการใช้งานคุกกี้ได้โดยเปิดหรือปิดการใช้งานคุกกี้ในเบราว์เซอร์ของตนเอง อย่างไรก็ตาม การปิดใช้งานคุกกี้อาจทำให้ผู้ใช้งานไม่สามารถเข้าถึงบางส่วนของเว็บไซต์หรือใช้งานบริการบางอย่างได้
                        การยอมรับเงื่อนไข: การเข้าใช้งานเว็บไซต์นี้แสดงว่าผู้ใช้งานยอมรับและเห็นชอบเงื่อนไขการใช้งานทั้งหมด รวมถึงการใช้งานคุกกี้ตามที่กล่าวไว้ข้างต้น

                    </div>
                </div>
            </div>
        </div>
    )
}

export default TermForUse
